import React from 'react';
import {stylesFooterSvg} from "./styles";

const Instagram = () => {
    const classes = stylesFooterSvg()
    return (
        <div>
            <svg className={classes.class} id="Icon_ionic-logo-instagram" data-name="Icon ionic-logo-instagram" xmlns="http://www.w3.org/2000/svg" width="21.875" height="23.354" viewBox="0 0 21.875 23.354">
                <path id="Контур_1" data-name="Контур 1" d="M19.995,6.446a4.41,4.41,0,0,1,3.219,1.429,4.991,4.991,0,0,1,1.339,3.436v9.731a5.028,5.028,0,0,1-1.339,3.436,4.377,4.377,0,0,1-3.219,1.429H10.88a4.41,4.41,0,0,1-3.219-1.429,4.991,4.991,0,0,1-1.339-3.436V11.311A5.028,5.028,0,0,1,7.662,7.875,4.377,4.377,0,0,1,10.88,6.446h9.115m0-1.946H10.88A6.626,6.626,0,0,0,4.5,11.311v9.731a6.626,6.626,0,0,0,6.38,6.811h9.115a6.626,6.626,0,0,0,6.38-6.811V11.311A6.626,6.626,0,0,0,19.995,4.5Z" transform="translate(-4.5 -4.5)"/>
                <path id="Контур_2" data-name="Контур 2" d="M24.992,11.919a1.463,1.463,0,1,1,1.367-1.46A1.412,1.412,0,0,1,24.992,11.919Z" transform="translate(-8.13 -5.108)"/>
                <path id="Контур_3" data-name="Контур 3" d="M16.719,13.2a3.779,3.779,0,0,1,3.646,3.892,3.779,3.779,0,0,1-3.646,3.892,3.779,3.779,0,0,1-3.646-3.892A3.779,3.779,0,0,1,16.719,13.2m0-1.946a5.664,5.664,0,0,0-5.469,5.838,5.664,5.664,0,0,0,5.469,5.838,5.664,5.664,0,0,0,5.469-5.838,5.664,5.664,0,0,0-5.469-5.838Z" transform="translate(-5.781 -5.412)"/>
            </svg>
        </div>
    );
};

export default Instagram;